# Data cleaning and preperation

### Handling missing data

In [53]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avacado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avacado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

Argument|Description|
:---|:---|
dropna | Filter axis labels based on whether values for each label have missing data, with varying thresholds for how much missing data to tolerate. |
fillna | Fill in missing data with some value or using an interpolation method such as 'ffill' or 'bfill'|
isnull | Return boolean values indicating which values are missing/NA.|
notnull | Negation of isnull.|

### Filtering out missing data

In [8]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
# equivalent to 
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.],[1., NA, NA],[NA, NA, NA],[NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.201819       NaN       NaN
1  0.459781       NaN       NaN
2 -0.236149       NaN -0.952084
3  0.690819       NaN  0.372048
4  0.006595  0.886743  0.387258
5  0.634800 -0.093521 -0.071569
6  1.069678  0.629667  1.559430

In [21]:
df.dropna()

          0         1         2
4  0.006595  0.886743  0.387258
5  0.634800 -0.093521 -0.071569
6  1.069678  0.629667  1.559430

In [22]:
df.dropna(thresh=2)

          0         1         2
2 -0.236149       NaN -0.952084
3  0.690819       NaN  0.372048
4  0.006595  0.886743  0.387258
5  0.634800 -0.093521 -0.071569
6  1.069678  0.629667  1.559430

## Filling in missing data

In [23]:
df.fillna(0)

          0         1         2
0  1.201819  0.000000  0.000000
1  0.459781  0.000000  0.000000
2 -0.236149  0.000000 -0.952084
3  0.690819  0.000000  0.372048
4  0.006595  0.886743  0.387258
5  0.634800 -0.093521 -0.071569
6  1.069678  0.629667  1.559430

In [24]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  1.201819  0.500000  0.000000
1  0.459781  0.500000  0.000000
2 -0.236149  0.500000 -0.952084
3  0.690819  0.500000  0.372048
4  0.006595  0.886743  0.387258
5  0.634800 -0.093521 -0.071569
6  1.069678  0.629667  1.559430

In [25]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.201819  0.000000  0.000000
1  0.459781  0.000000  0.000000
2 -0.236149  0.000000 -0.952084
3  0.690819  0.000000  0.372048
4  0.006595  0.886743  0.387258
5  0.634800 -0.093521 -0.071569
6  1.069678  0.629667  1.559430

In [26]:
df.fillna(method='ffill')

          0         1         2
0  1.201819  0.000000  0.000000
1  0.459781  0.000000  0.000000
2 -0.236149  0.000000 -0.952084
3  0.690819  0.000000  0.372048
4  0.006595  0.886743  0.387258
5  0.634800 -0.093521 -0.071569
6  1.069678  0.629667  1.559430

In [27]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.201819  0.000000  0.000000
1  0.459781  0.000000  0.000000
2 -0.236149  0.000000 -0.952084
3  0.690819  0.000000  0.372048
4  0.006595  0.886743  0.387258
5  0.634800 -0.093521 -0.071569
6  1.069678  0.629667  1.559430

In [28]:
data = pd.Series([1.,NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

|Argument|Description|
|---|---|
|Value| Scalar value or dict-like object to use to fill missing values|
|Method| Interpolation: by default 'ffill' if function called with no other argument|
Axis| Axis to fill on; default axis=0
|inplace| Modify the calling object without producing a copy|
Limit| For forward and backward filling, maximum number of consecutive periods to fill|

## Data Transformations
### Removing Duplicates

In [30]:
data = pd.DataFrame({'k1':['one', 'two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [34]:
data['v1']=range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [35]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming data using a function or mapping

In [45]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon', 'pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [46]:
meat_to_animal={'bacon':'pig','pulled pork': 'pig', 'pastrami':'cow','corned beef': 'cow', 'honey ham': 'pig','nova lox':'salmon'}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [47]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [48]:
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [49]:
data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing values

In [50]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [51]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [54]:
data.replace([-999,-1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
data.replace({-999:np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming axis indexes

In [60]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),index=['Ohio','Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])
transform = lambda x : x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [61]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [62]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [65]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [66]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretisation and binning

In [67]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [68]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [69]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [70]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [71]:
pd.cut(ages,[18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [73]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [75]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.26, 0.5], (0.5, 0.75], (0.75, 0.99], (0.75, 0.99], (0.26, 0.5], ..., (0.26, 0.5], (0.5, 0.75], (0.26, 0.5], (0.75, 0.99], (0.013, 0.26]]
Length: 20
Categories (4, interval[float64, right]): [(0.013, 0.26] < (0.26, 0.5] < (0.5, 0.75] < (0.75, 0.99]]

In [76]:
data = np.random.randn(1000) #normally distributed
cats = pd.qcut(data, 4) # cut into quartiles
cats

[(-0.675, 0.0174], (-0.675, 0.0174], (-4.281000000000001, -0.675], (-0.675, 0.0174], (-0.675, 0.0174], ..., (0.0174, 0.602], (0.0174, 0.602], (-0.675, 0.0174], (0.0174, 0.602], (-0.675, 0.0174]]
Length: 1000
Categories (4, interval[float64, right]): [(-4.281000000000001, -0.675] < (-0.675, 0.0174] < (0.0174, 0.602] < (0.602, 2.943]]

In [77]:
pd.value_counts(cats)

(-4.281000000000001, -0.675]    250
(-0.675, 0.0174]                250
(0.0174, 0.602]                 250
(0.602, 2.943]                  250
dtype: int64

In [78]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.252, 0.0174], (-1.252, 0.0174], (-1.252, 0.0174], (-1.252, 0.0174], (-1.252, 0.0174], ..., (0.0174, 1.226], (0.0174, 1.226], (-1.252, 0.0174], (0.0174, 1.226], (-1.252, 0.0174]]
Length: 1000
Categories (4, interval[float64, right]): [(-4.281000000000001, -1.252] < (-1.252, 0.0174] < (0.0174, 1.226] < (1.226, 2.943]]

## detecting and filtering outliers

In [79]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010686    -0.005257    -0.016144    -0.003333
std       1.022255     0.990532     0.995930     1.038207
min      -3.659967    -3.302659    -3.575894    -3.696882
25%      -0.672352    -0.630800    -0.701741    -0.697354
50%       0.033191    -0.035374    -0.017694    -0.008297
75%       0.717380     0.690125     0.645954     0.714088
max       3.923644     2.859349     3.843727     3.291411

In [81]:
col = data[2]
col[np.abs(col)>3]

321    3.843727
495   -3.575894
593    3.097013
Name: 2, dtype: float64

In [82]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
23   0.219295  1.031994  0.964953  3.291411
33  -3.533899 -0.417148  1.845354  0.175670
128 -1.411574  0.560103 -1.908271 -3.015124
139 -3.659967 -0.178675 -0.643039  0.326431
284  2.777468 -3.212724  0.904533  0.640239
306  3.039873  1.737389  2.326688  0.306111
317 -1.311723 -0.694564 -1.131514 -3.696882
321  0.072779  1.218182  3.843727 -0.122119
388 -0.199985 -1.257808  0.064405 -3.292024
451 -1.017999 -0.354350 -0.719756  3.059142
457 -0.680045 -3.302659  0.504262 -0.707942
495  0.224440 -1.246109 -3.575894  0.350992
506 -0.293051 -0.294611 -0.686623 -3.096534
593 -0.522786  1.018871  3.097013  1.172179
639 -3.263072  0.715813  0.093385  0.944812
701  1.888143 -3.013550  0.186550 -1.075037
808  3.923644  0.560503 -0.248508 -1.988044
913  3.041316 -0.654925  0.701695 -0.507998

In [83]:
data[np.abs(data)>3] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.011138    -0.004728    -0.016509    -0.002583
std       1.014181     0.988860     0.990809     1.033680
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.672352    -0.630800    -0.701741    -0.697354
50%       0.033191    -0.035374    -0.017694    -0.008297
75%       0.717380     0.690125     0.645954     0.714088
max       3.000000     2.859349     3.000000     3.000000

In [84]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2 -1.0 -1.0  1.0 -1.0
3  1.0 -1.0  1.0  1.0
4  1.0 -1.0 -1.0  1.0

### Permutation and random sampling

In [86]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([3, 2, 0, 4, 1])

In [87]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [89]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7

In [91]:
 df.sample(n=3)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19

In [93]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
0    5
4    4
3    6
3    6
4    4
1    7
2   -1
2   -1
4    4
dtype: int64

## Computing indicator/Dummy variables

In [95]:
df = pd.DataFrame({'key':['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [96]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [99]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::', header=None, names=mnames)
movies[:10]

/tmp/ipykernel_32612/2456828771.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep='::', header=None, names=mnames)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [106]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
    genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [107]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [109]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [110]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [111]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [113]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [115]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [116]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation

In [1]:
val = ' a, b,  guido'

In [4]:
val.split(',')

[' a', ' b', '  guido']

In [5]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [7]:
first, second, third, = pieces
first+'::'+second+'::'+third

'a::b::guido'

In [8]:
'::'.join(pieces)

'a::b::guido'

In [9]:
'guido'in val

True

In [10]:
val.index(',')

2

In [11]:
val.find(':')

-1

In [12]:
val.count(',')

2

In [13]:
val.replace(',', '::')

' a:: b::  guido'

In [14]:
val.replace(',', '')

' a b  guido'

![built-in string method](Built_in_str_method.png)

### Regular Expressions

In [16]:
import re

In [17]:
text = "foo     bar\t baz   \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [20]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [21]:
regex.findall(text)

['     ', '\t ', '   \t']

In [34]:
text = "Dave dave@google.com Steve Steve@gmail.com Rob rob@gmail.com Ryan ryan@yahoo.com"
text

'Dave dave@google.com Steve Steve@gmail.com Rob rob@gmail.com Ryan ryan@yahoo.com'

In [45]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [46]:
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)
regex.findall(text)

[('dave', 'google', 'com'),
 ('Steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [47]:
m = regex.search(text)
m

In [48]:
text[m.start():m.end()]

'dave@google.com'

In [39]:
print(regex.match(text))

None

In [49]:
print(regex.sub('REDACTED', text))

Dave REDACTED Steve REDACTED Rob REDACTED Ryan REDACTED

In [41]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [42]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [43]:
m = regex.match('wes@bright.net')

In [44]:
m.groups()

('wes', 'bright', 'net')

In [50]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('Steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [51]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com Steve Username: Steve, Domain: gmail, Suffix: com Rob Username: rob, Domain: gmail, Suffix: com Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorised String functions in pandas

In [59]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [58]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [60]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [61]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [62]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [64]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object